pmo-dataset/graphviz/52.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "StartNoneEvent" -> "MPON sents the\ndismissal to the\nMPOO";
  "MPON sents the\ndismissal to the\nMPOO" -> "MPOO reviews the\ndismissal";
  "MPOO reviews the\ndismissal" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "MPOO opposes the\ndismissal";
  "ExclusiveGateway_1" -> "MPOO confirmes the\ndismissal";
  "MPOO opposes the\ndismissal" -> "ExclusiveGateway_2";
  "MPOO confirmes the\ndismissal" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "EndNoneEvent";

  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
}
