pmo-dataset/variations/mermaid_with_ids/52.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["MPON sents the\ndismissal to the\nMPOO"]
	Task_2["MPOO reviews the\ndismissal"]
	Task_3["MPOO opposes the\ndismissal"]
	Task_4["MPOO confirmes the\ndismissal"]
	StartNoneEvent_1((" "))
	EndNoneEvent_1((" ")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}

	StartNoneEvent_1 --> Task_1
	Task_1 --> Task_2
	Task_2 --> ExclusiveGateway_1
	ExclusiveGateway_1 --> Task_3
	ExclusiveGateway_1 --> Task_4
	Task_3 --> ExclusiveGateway_2
	Task_4 --> ExclusiveGateway_2
	ExclusiveGateway_2 --> EndNoneEvent_1
